1. Introduction to Pandas

   - Pandas is an open-source Python library used for data analysis and data manipulation.

Key Features:

  - Works with tabular data (rows & columns)

  - Handles missing values easily

  - Powerful data filtering & grouping

  - Built on NumPy

2. Pandas Data Structures
2.1 Series (1-Dimensional)

A Series is a one-dimensional labeled array.

In [21]:
import sys
print(sys.executable)

c:\INTERNSHIP\.venv\Scripts\python.exe

In [22]:
import sys
print(sys.executable)

c:\INTERNSHIP\.venv\Scripts\python.exe

In [ ]:
%pip install pandas

Requirement already satisfied: pandas in c:\internship\.venv\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\internship\.venv\lib\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\internship\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\internship\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\internship\.venv\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\internship\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [24]:
import pandas as pd
import numpy as np

In [25]:
s = pd.Series([23,45,67,12,120,56])

s.dtype

dtype('int64')

In [26]:
s = pd.Series([23,45,67,12,120,56.0])
s[2]= 100
del s[2]
s

0     23.0
1     45.0
3     12.0
4    120.0
5     56.0
dtype: float64

In [27]:
s = pd.Series([23, 45, 67, 12, 120, 56.0], index = range(100,106))
s
s[101]

np.float64(45.0)

DATAFRAME

In [28]:
roll = pd.Series([1, 2, 3, 4,5])
name = pd.Series(['Ajay', 'Sia', 'Natasha', 'Ravindra', 'Anuj'])
marks = pd.Series([67, 78, 81, 65, 89])

name

0        Ajay
1         Sia
2     Natasha
3    Ravindra
4        Anuj
dtype: object

In [ ]:
df = pd.DataFrame({
    'Roll': roll,
    'Name': name,
    'Marks' : marks
})
df

   roll      name  marks
0     1      Ajay     67
1     2       Sia     78
2     3   Natasha     81
3     4  Ravindra     65
4     5      Anuj     89

In [36]:
df = pd.DataFrame({
    'roll': roll,
    'name': name,
    'marks': marks
})
df
df.shape
df.size

15

In [39]:
df = pd.DataFrame({
    'Name': name,
    'Roll': roll,
    "Marks": marks
})
df
df.columns

Index(['Name', 'Roll', 'Marks'], dtype='object')

In [40]:
# current working directory

import os
os.getcwd()

'c:\\INTERNSHIP\\python programming\\Week 4'

In [48]:
df = pd.read_csv("data.csv")
df

   id  name   marks
0   1  Asha      85
1   2  Ravi      90
2   3  Ashu      95

In [49]:
headers = ["A", "B", "C", "D","E"]
df1 = pd.read_csv("data.csv", names = headers)
df1

    A     B       C   D   E
0  id  name   marks NaN NaN
1   1  Asha      85 NaN NaN
2   2  Ravi      90 NaN NaN
3   3  Ashu      95 NaN NaN

In [51]:
df1 = pd.read_csv('data.csv', sep ='\t')
df1

  id,name, marks
0      1,Asha,85
1      2,Ravi,90
2      3,Ashu,95

In [13]:
import pandas as pd

df = pd.read_csv("data.csv")
df.T
df.dtypes
# df.head()
df.tail(2)

   id    name   marks
4   5   Sneha      75
5   6  Sakshi      98

In [ ]:
import pandas as pd

df = pd.read_csv("data.csv")
df.describe()

             id      marks
count  6.000000   6.000000
mean   3.500000  87.166667
std    1.870829   8.841191
min    1.000000  75.000000
25%    2.250000  81.250000
50%    3.500000  87.500000
75%    4.750000  93.750000
max    6.000000  98.000000

In [ ]:
import pandas as pd
df = pd.read_csv('data.csv')
df.max()

   id       name   marks
0   1       Asha      85
1   2       Ravi      90
2   3       Ashu      95
3   4  Vaishnavi      99
4   5      Sneha      75
5   6     Sakshi      98

In [ ]:
import pandas as pd

df = pd.read_csv('data.csv')
df.iloc[1:4, 0:3]

   id       name   marks
1   2       Ravi      90
2   3       Ashu      95
3   4  Vaishnavi      99

In [ ]:
import pandas as pd
df = pd.read_csv("data.csv")

df.loc[:, "name"]

0         Asha
1         Ravi
2         Ashu
3    Vaishnavi
4        Sneha
5       Sakshi
Name: name, dtype: object

In [32]:
import pandas as pd
df = pd.read_csv("data.csv")

# df.iloc[[5, 6, 8], 0:3]
df.loc[:,'name']

0          Asha
1          Ravi
2          Ashu
3     Vaishnavi
4         Sneha
5        Sakshi
6       Anushka
7          Riya
8          Siya
9          Anvi
10         Anay
Name: name, dtype: object

In [41]:
import pandas as pd
df = pd.read_csv("data.csv")
df['name']
df.drop(2)

    id       name   marks
0    1       Asha      85
1    2       Ravi      90
3    4  Vaishnavi      99
4    5      Sneha      75
5    6     Sakshi      98
6    7    Anushka      85
7    8       Riya      70
8   10       Siya      78
9   11       Anvi      89
10  12       Anay      91

In [44]:
import pandas as pd
df = pd.read_csv("data.csv")
df
# df.drop('roll', axis = 1)

    id       name   marks
0    1       Asha      85
1    2       Ravi      90
2    3       Ashu      95
3    4  Vaishnavi      99
4    5      Sneha      75
5    6     Sakshi      98
6    7    Anushka      85
7    8       Riya      70
8   10       Siya      78
9   11       Anvi      89
10  12       Anay      91